Repository: QuachGia1994/GlassPulse
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ja, vi, zh_hans

# game.input.direction.clockwise
source: Direction: clockwise
ja: 方向：時計回り
vi: Hướng: thuận chiều
zh_hans: 方向：顺时针

# game.input.direction.counterclockwise
source: Direction: counterclockwise
ja: 方向：反時計回り
vi: Hướng: ngược chiều
zh_hans: 方向：逆时针

# game.input.hint.over
source: Use Retry or Choose Mode. Background taps do nothing.
ja: 「もう一度」または「モードを選ぶ」を使用してください。背景タップは無効です。
vi: Dùng Chơi lại hoặc Chọn mode. Chạm nền không có tác dụng.
zh_hans: 请使用“再玩一次”或“选择模式”。点击背景不会触发操作。

# game.input.hint.paused
source: Use the Resume button to continue. Background taps do nothing.
ja: 続けるには再開ボタンを使用してください。背景タップは無効です。
vi: Dùng nút Tiếp tục để chơi. Chạm nền không có tác dụng.
zh_hans: 请使用继续按钮。点击背景不会触发操作。

# game.input.hint.playing
source: Double-tap to reverse direction once.
ja: ダブルタップで進行方向を1回反転します。
vi: Chạm hai lần bằng VoiceOver để đảo chiều đúng một lần.
zh_hans: 双击一次以反转方向。

# game.input.hint.start
source: Double-tap to start the selected run.
ja: ダブルタップで選択中のランを開始します。
vi: Chạm hai lần bằng VoiceOver để bắt đầu lượt chơi đã chọn.
zh_hans: 双击以开始所选对局。

# game.input.label
source: Gameplay surface
ja: ゲーム操作エリア
vi: Vùng điều khiển trò chơi
zh_hans: 游戏操作区域

# game.metric.shards
source: Shards
ja: シャード
vi: Shard
zh_hans: 碎片

# game.over.chooseMode
source: Choose Mode
ja: モードを選ぶ
vi: Chọn mode
zh_hans: 选择模式

# game.over.dailyBonus.format
source: Daily bonus: +%lld
ja: デイリーボーナス：+%lld
vi: Thưởng Daily: +%lld
zh_hans: 每日奖励：+%lld

# game.over.retry
source: Retry
ja: もう一度
vi: Chơi lại
zh_hans: 再玩一次

# game.over.reward.format
source: Reward: +%lld shards
ja: 報酬：+%lld シャード
vi: Thưởng: +%lld shard
zh_hans: 奖励：+%lld 碎片

# game.status.over.collision
source: Run over
ja: ゲームオーバー
vi: Thua rồi
zh_hans: 游戏结束

# game.status.over.completed
source: Completed
ja: クリア
vi: Hoàn thành
zh_hans: 已完成

# settings.close.label
source: Close Settings
ja: 設定を閉じる
vi: Đóng cài đặt
zh_hans: 关闭设置

# settings.haptics.hint
source: Event and proximity vibration.
ja: イベントと接近の振動。
vi: Rung theo sự kiện và khoảng cách.
zh_hans: 事件与接近振动。

# settings.haptics.label
source: Haptics
ja: ハプティクス
vi: Rung phản hồi
zh_hans: 触觉反馈

# settings.highContrast.hint
source: Raises text, ring and border contrast with non-color state cues.
ja: 文字・リング・枠のコントラストを上げ、色によらない状態表示を追加します。
vi: Tăng tương phản chữ, vòng, viền và thêm dấu hiệu trạng thái không dựa vào màu.
zh_hans: 提高文字、圆环与边框对比度，并加入非颜色状态提示。

# settings.highContrast.label
source: High Contrast
ja: ハイコントラスト
vi: Tương phản cao
zh_hans: 高对比度

# settings.language.hint
source: Applies immediately and persists across launches.
ja: すぐに適用され、起動後も保持されます。
vi: Áp dụng ngay và được lưu cho các lần mở sau.
zh_hans: 立即生效并在启动后保持。

# settings.language.label
source: Language
ja: 言語
vi: Ngôn ngữ
zh_hans: 语言

# settings.language.system
source: System
ja: システムに従う
vi: Hệ thống
zh_hans: 跟随系统

# settings.music.credit
source: Music: “Formant 1” by Benjamin Marzinski (CC0).
ja: 音楽:「Formant 1」Benjamin Marzinski(CC0)。
vi: Nhạc: “Formant 1” của Benjamin Marzinski (CC0).
zh_hans: 音乐：“Formant 1”，Benjamin Marzinski（CC0）。

# settings.music.hint
source: Loops the bundled ambient track.
ja: 内蔵のアンビエントトラックをループ再生します。
vi: Phát lặp bản nhạc nền đi kèm.
zh_hans: 循环播放内置的环境音乐。

# settings.music.label
source: Background Music
ja: バックグラウンドミュージック
vi: Nhạc nền
zh_hans: 背景音乐

# settings.open.label
source: Open Settings
ja: 設定を開く
vi: Mở cài đặt
zh_hans: 打开设置

# settings.reduceMotion.hint
source: Disables splash pulsing and ring breathing. Gameplay timing is unchanged.
ja: スプラッシュの脈動とリングの呼吸を無効化します。ゲームプレイのタイミングは変わりません。
vi: Tắt nhấp nháy splash và nhịp thả vòng. Thời gian chơi không đổi.
zh_hans: 关闭启动画面脉动与圆环呼吸。游戏计时不受影响。

# settings.reduceMotion.label
source: Reduce Motion
ja: モーション削減
vi: Giảm chuyển động
zh_hans: 减弱动态效果

# settings.section.audio
source: Audio
ja: オーディオ
vi: Âm thanh
zh_hans: 音频

# settings.section.credit
source: Music credit
ja: 音楽クレジット
vi: Ghi công nhạc
zh_hans: 音乐署名

# settings.section.display
source: Display
ja: 表示
vi: Hiển thị
zh_hans: 显示

# settings.section.feedback
source: Feedback
ja: フィードバック
vi: Phản hồi
zh_hans: 反馈

# settings.section.language
source: Language
ja: 言語
vi: Ngôn ngữ
zh_hans: 语言

# settings.sfx.hint
source: Reverse, collect and collision tones.
ja: 反転・収集・衝突の音。
vi: Âm đảo chiều, thu thập và va chạm.
zh_hans: 反向、收集与碰撞音。

# settings.sfx.label
source: Sound Effects
ja: 効果音
vi: Hiệu ứng âm thanh
zh_hans: 音效

# settings.title
source: Settings
ja: 設定
vi: Cài đặt
zh_hans: 设置
